Revit 2027 API
ParameterTypeId.SystemsAnalysisReportFolder Property
 "Reports Folder Path"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SystemsAnalysisReportFolder { get; }
Public Shared ReadOnly Property SystemsAnalysisReportFolder As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SystemsAnalysisReportFolder {
	ForgeTypeId^ get ();
}
static member SystemsAnalysisReportFolder : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace